<!DOCTYPE html>
<html lang="ru">
<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width">

	<title>Лазеркидс - Что такое Лазертаг?</title>

	
    <link rel="stylesheet" href="css/footer(learn).css">
    <link rel="stylesheet" href="css/header(learn).css">
    <link rel="stylesheet" href="css/font-awesome.css"> 
    <link rel="stylesheet" href="css/about.css">
    <link rel="stylesheet" href="css/sitebar.css">
    <link rel="stylesheet" href="css/media.css">
    <link rel="stylesheet" href="css/style.css">
    <link rel="stylesheet" href="css/katalog.css">

   
    <link href="https://fonts.googleapis.com/css?family=Open+Sans+Condensed:300|Roboto+Mono" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css?family=Mali|Raleway|Slabo+27px" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css?family=Montserrat:200i" rel="stylesheet">

    <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.6.1/css/font-awesome.min.css">

    <link href="https://fonts.googleapis.com/css?family=Montserrat:300i" rel="stylesheet">

</head>
<body>
<?php require_once "header.php"; ?>
    <main>
    	<article >
        <div class="about aboutheader"><h2>Что такаое Лазертаг?</h2></div>
      <div class="about"><p>Лазертаг (Также - лазерный бой, лазерный пейнтбол) - высокотехнологичная игра, происходящая в реальном времени и пространстве. Суть игры состоит в поражении игроков-противников безопасными лазерными выстрелами из бластера. Собственно «поражение» игрока происходит путём регистрации луча бластера-автомата специальными датчиками оппонента (сенсорами), закрепленными на одежде игрока.<br><br> Помимо развлекательных свойств данная игра еще и полезна — развивает выносливость, глазомер и позволяет быстро сбросить лишний вес. По сравнению с пейнтболом и страйкболом, лазертаг имеют существенные преимущества, такие как:<br><br> Высокая дальность стрельбы, отсутствие помех от ветра при использовании на открытом воздухе , отсутствие необходимости перезарядки картриджей и пуль, нелимитированное  количество зарядов, высокая зрелищность, отсутствие необходимости применять специальную одежду и шлемы-маски, и др. Немаловажным фактором является также то, что, в отличие от пейнтбола, в лазертаге полностью отсутствуют какие-либо болевые ощущения и травматизм при попадании «выстрела» в игрока. 
      </div>
      <div class="about aboutheader"><h2>Разновидности Лазертагов</h2>
      <p>Существуют несколько типов лазертагов: «аренные» (предназначенные для проведения лазерного боя в закрытом помещении в стационарно оборудованном лабиринте), «внеаренные» (предназначенные для игры на открытом воздухе); «универсальные» или «мобильные» — хотя и рассчитаны на использование с лабиринтом, не требуют технической инсталляции и коммутируются при помощи обмена радиосигналами с мобильным управляющим компьютером (либо обходятся вообще без него — в упрощенных вариантах); «армейские» — военные системы имитации тактического боя.

Также отдельно могут выделяться лазертэги т. н. «потребительского» класса — рассчитанные не на коммерческое использование, а на покупку оборудования индивидуальными игроками, и т. н. HSL (Home Style Lasertag) — с оборудованием, изготовляемым самими игроками.<br><br> С точки зрения игроков, одним из основных критериев различия аренных лазертэгов по категориям является стиль игры. Он определяется, в первую очередь, скорострельностью оборудования и варьируется от «быстрого» («силового» или «спортивного», на грани с контактным спортом) до т. н. «медленных» («бродилок») и ролевых игр. В лазертэгах, относящихся к «быстрому» стилю (это, в первую очередь, относится к Q-Zar) оборудование обычно имеет меньше датчиков поражения (что требует ведения более прицельного огня) и более высокую скорострельность автоматов (что, в свою очередь, диктует более высокий темп игры). В «медленных» и ролевых играх (классический пример — Laser Quest) добавляется больше датчиков поражения (снижается требование точного прицела — иногда достаточно просто попасть в образ игрока) и, обычно, снижается скорострельность в 2-3 раза по сравнению с Q-zar. В таком случае от игрока уже не требуется развития высокой скорости и большой выносливости; арены в таких Лазертэгах обычно имеют гораздо больше спецэффектов, а лабиринт отличается большей запутанностью.<br><br>Таким образом, имея в своей основе один и тот же принцип, современные лазертэги удовлетворяют потребностям и желаниям людей с различной степенью физподготовки и различными предпочтениями. Следует также отметить, что во многих лазертэг-системах по согласованию с администрацией можно откорректировать скорострельность и задать тот или иной сценарий игры — от «соло» (каждый играет сам за себя) до «командной» (групповое противостояние) и, даже «ролевой» (с различными характеристиками для каждого участника — в зависимости от его игровой «роли»).<br><br>По сравнению с пейнтболом и страйкболом, лазертэги имеют существенные преимущества, такие как: высокую дальность стрельбы, отсутствие помех от ветра при использовании на открытом воздухе (внеаренные Лазертэги), отсутствие необходимости перезарядки картриджей и пуль (при желании есть возможность имитации), нелимитированное (в принципиальном понимании) количество зарядов, высокая зрелищность, отсутствие необходимости применять специальную одежду и шлемы-маски, и др. Немаловажным фактором является также то, что, в отличие от пейнтбола, в лазертэге полностью отсутствуют какие-либо болевые ощущения и травматизм при попадании «выстрела» в игрока. С другой стороны, есть и некоторые минусы. Например, попадая по игроку с больших дистанций во внеаренной игре, стрелок совсем не видит и не чувствует, что попал в цель, то есть нет обратной связи и бой при этом теряет свою осязаемость (но ощущение приходит с опытом). Кроме того, выстрелы сопровождаются слабыми звуковыми эффектами (военные модификации используют для звуковой имитации боя холостые патроны).<br><br>Для пейнтболистов выпускаются специальные модульные лазертэг-системы, превращающие пейнтбольный маркер в лазертэговский бластер — пейнтбольный маркер издаёт громкий газовый хлопок, а выстреливает инфракрасным лучом. Этот вариант позволяет по желанию игрока легко и быстро переходить от пейнтбола к лазертэгу и наоборот. </p></div>

<div class="about aboutheader">
  <h2>Правила игры</h2>
  <p>Перед игрой участвующие разбиваются на команды, игрокам выдаётся амуниция (жилеты с датчиками и бластерные автоматы — в аренном лазертэге, бластеры и повязки с сенсорами поражения — во внеаренном варианте). В аренном лазертэге игра происходит в лабиринте, подсвеченном флуоресцирующим светом и сдобренном различными примочками — от световых спецэффектов и звуков до имитации дымовых завес, во внеаренном лазертэге игры проходят на открытом воздухе и/или в специально не оборудованных помещениях (ангар, руины, строящийся объект и т. п.).<br><br>

Побеждает та команда, которая наибольшее число раз поразит «базу» противника и/или поразит больше чужих игроков (все эти действия регистрируются центральным компьютером, считывающим накопленную информацию с автоматов во время их «перезарядки» на специальном стенде либо в режиме реального времени по радиосигналу). После окончания игры каждый игрок обычно получает индивидуальную распечатку с результатами игры и личной статистикой.<br><br>

Аренная команда обычно состоит из 5-6 игроков. Игрокам рекомендуется также разделять «функции», например: два человека — в атаке («атакующие»), двое — обороняют базу («обороняющиеся»), и один — помогает тем, кому сложно («охотник»). Стандартная игра в аренном лазертэге длится обычно 15+15 минут, после первых 15 минут происходит смена цветов команд (смена дислокации относительно командной «базы»), что позволяет создать равные условия для команд на итоговую победу.<br><br>

Во внеаренном варианте количество игроков и разделение по ролям практически не ограничено, и зависит только от поставленной игровой задачи и условий местности. Средняя продолжительность боя 20 мин.- 1 час, в зависимости от задачи, но может быть ограничена по времени.<br><br>

Наравне с меткостью и быстротой реакции игроков, одним из основных критериев, влияющих на победу, является также тактика и стратегия команды.<br><br>

Игра (особенно на оборудовании с высокой скорострельностью — как, например, Q-Zar, происходящая в чрезвычайно высоком темпе, или внеаренная игра с использованием достаточно тяжелых массогабаритных макетов оружия (СВД,ПКМ) требует значительных физических усилий. Хотя, номинально, в лабиринте и нельзя бегать, многие игроки набирают достаточно высокую скорость, что, иногда (при столкновении) может причинить определённый вред. А во внеаренном лазертэге участников поджидают всевозможные естественные препятствия, созданные природой. Как лазерные (обычно используемые в качестве маркеров), так и инфракрасные лучи (обычно именно ими поражается противник), которыми стреляют автоматы, безопасны для здоровья. Заблудиться в лабиринте невозможно — он для этого недостаточно велик, а во внеаренном лазертэге участников сопровождают инструкторы. Так что игра безвредна, а кроме того, ещё и полезна — развивает выносливость, глазомер и позволяет быстро сбросить лишний вес.</p></div>
<div class="about"><p>Информация взята с источника <a href="https://ru.wikipedia.org/wiki/Лазертаг" target="_blank">"Wikipedia.org"</a></p></div> 
      </article>
      <?php require_once "sitebar.php"; ?>
    </main>
    <?php require_once "footer.php"; ?>
    <script>

    var btn = document.getElementsByClassName('btn');
     
  for(let i = 0; i < btn.length; i++) {
    btn[i].addEventListener('click', function() {
  
    if(!(this.classList.contains('active'))){
      for(let i = 0; i < btn.length; i++){
         btn[i].classList.remove('active');
       }
      btn[i].classList.add('active');
      } else {
        btn[i].classList.remove('active');
        }
    })
   } 
  </script>
</body>
</html>